Саракташ2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаличия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьЭтикетку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварИзРеестраНХП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеЦеныЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОптРазрезыЗначения</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>EnumRef.ОптРазрезыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПохожиеРозничныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МастерицыДляПроверки</name>
    <attributes>
      <name>Мастерица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Enums/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаказовПокупателей</name>
  <enumValues>
    <name>Розничный</name>
  </enumValues>
  <enumValues>
    <name>Оптовый</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Catalogs/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗаказов</name>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отменен</name>
      <description>Отменен</description>
    </items>
  </predefined>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварСписывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗаказуЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьЗадолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируетсяДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВОтчетеПоВозвратам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборКурьерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DPD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Номенклатура/Forms/ФормаСпискаСправка/Module.bsl
&НаКлиенте
Перем мсВЗаказ;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныйРеквизитЦвет = ПолучитьДополнительныеРеквизитыПоКоду("000000002");
	ДополнительныйРеквизитРазмер = ПолучитьДополнительныеРеквизитыПоКоду("000000001");
	ДополнительныйРеквизитПроизводство = ПолучитьДополнительныеРеквизитыПоКоду("000000003");
	ДополнительныйРеквизитСостав = ПолучитьДополнительныеРеквизитыПоКоду("000000004");
	
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("СвойствоЦвет",ДополнительныйРеквизитЦвет);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("СвойствоРазмер",ДополнительныйРеквизитРазмер);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("СвойствоПроизводство",ДополнительныйРеквизитПроизводство);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("СвойствоСостав",ДополнительныйРеквизитСостав);
	
	мсВЗаказ = Новый Массив;
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("мсВЗаказ", мсВЗаказ);
	
	Элементы.ВозможныйЗаказ.Видимость = Ложь;
	
	//Заполнить списки выбора
	//Цвет
	Элементы.ОтборЦвет.СписокВыбора.Очистить();
	Элементы.ОтборЦвет.СписокВыбора.ЗагрузитьЗначения(ПолучитьВариантыДопРеквизитов(ДополнительныйРеквизитЦвет)); //Цвет
	
	//Размер
	Элементы.ОтборРазмер.СписокВыбора.Очистить();
	Элементы.ОтборРазмер.СписокВыбора.ЗагрузитьЗначения(ПолучитьВариантыДопРеквизитов(ДополнительныйРеквизитРазмер)); //Размер
	
	//Производство
	Элементы.ОтборПроизводство.СписокВыбора.Очистить();
	Элементы.ОтборПроизводство.СписокВыбора.ЗагрузитьЗначения(ПолучитьВариантыДопРеквизитов(ДополнительныйРеквизитПроизводство)); //Производство
	
	//Состав
	Элементы.ОтборСостав.СписокВыбора.Очистить();
	Элементы.ОтборСостав.СписокВыбора.ЗагрузитьЗначения(ПолучитьВариантыДопРеквизитов(ДополнительныйРеквизитСостав)); //Производство
	
	//Отбор диапазон цены
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМинимум",ОтборЦенаМинимум);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМаксимум",ОтборЦенаМаксимум);	
	
	
КонецПроцедуры

//Получение данных на сервере{
Функция ПолучитьДополнительныеРеквизитыПоКоду(Код)
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизиты.НайтиПоКоду(Код);	
КонецФункции

Функция ПолучитьВариантыДопРеквизитов(ДополнительныйРеквизит)
	
	мсВариантыЗначений = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеЗначенияРеквизитов.Ссылка КАК ВариантЗначения,
	|	ДополнительныеЗначенияРеквизитов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ДополнительныеЗначенияРеквизитов КАК ДополнительныеЗначенияРеквизитов
	|ГДЕ
	|	ДополнительныеЗначенияРеквизитов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|АВТОУПОРЯДОЧИВАНИЕ";	
	Запрос.УстановитьПараметр("Владелец", ДополнительныйРеквизит);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мсВариантыЗначений.Добавить(Выборка.ВариантЗначения);		
	КонецЦикла;
	
	Возврат мсВариантыЗначений;
	
КонецФункции

//}Получение данных на сервере

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВЗаказ" Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		нСтрока = мсВЗаказ.Найти(ВыбраннаяСтрока);
		Если нСтрока = Неопределено Тогда 
			мсВЗаказ.Добавить(ВыбраннаяСтрока);			
		Иначе
			мсВЗаказ.Удалить(нСтрока);
		КонецЕсли;	
		
		СписокТоваров.Параметры.УстановитьЗначениеПараметра("мсВЗаказ", мсВЗаказ);
		
		Элементы.ВозможныйЗаказ.Видимость = мсВЗаказ.Количество() <> 0;
		
		ЗаполнитьВозможныйЗаказ(мсВЗаказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаказНажатие(Элемент)
	Элементы.ВозможныйЗаказ.Видимость = НЕ Элементы.ВозможныйЗаказ.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВозможныйЗаказ(мсВЗаказ)
	
	ВозможныйЗаказ.Очистить();
	
	Для Каждого Номенклатура ИЗ мсВЗаказ Цикл 
		
		нСтрока = ВозможныйЗаказ.Добавить();
		
		нСтрока.Номенклатура = Номенклатура;
		нСтрока.Количество = 1;
		
		РасчитатьДанныеПоСтроке(нСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьДанныеПоСтроке(Строка)
	
	Если Строка = Неопределено Тогда 
		Возврат;		
	КонецЕсли;
	
	//Цена
	Строка.Цена = ПолучитьЦенуНоменклатуры(Строка.Номенклатура);
	
	//Сумма
	Строка.Сумма = Строка.Количество * Строка.Цена;
	
	//Обновление подвала
	Элементы.ВозможныйЗаказ.ПодчиненныеЭлементы.ТаблицаЗаказКоличество.ТекстПодвала = ВозможныйЗаказ.Итог("Количество");
	Элементы.ВозможныйЗаказ.ПодчиненныеЭлементы.ТаблицаЗаказСумма.ТекстПодвала = Формат(ВозможныйЗаказ.Итог("Сумма"),"ЧДЦ=2");
	
КонецПроцедуры

Функция ПолучитьЦенуНоменклатуры(Номенклатура) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();	 
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ВозможныйЗаказПриИзменении(Элемент)

	мсВЗаказ = Новый Массив;
	Для Каждого Строка Из ВозможныйЗаказ Цикл
		мсВЗаказ.Добавить(Строка.Номенклатура);		
	КонецЦикла;	
	
	РасчитатьДанныеПоСтроке(Элемент.ТекущиеДанные);
	
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("мсВЗаказ", мсВЗаказ);
	
КонецПроцедуры

//Отборы{

Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, СписокТоваров, ИмяПоляОтбораСписка);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, СписокТоваров, МеткаИД);

КонецПроцедуры

//Цвет
&НаКлиенте
Процедура ОтборЦветОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ЗначениеЦвет", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

//Категория
&НаКлиенте
Процедура ОтборКатегорияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Категория", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

//Размер
&НаКлиенте
Процедура ОтборРазмерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ЗначениеРазмер", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

//Производство
&НаКлиенте
Процедура ОтборПроизводствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ЗначениеПроизводство", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

//Состав
&НаКлиенте
Процедура ОтборСоставОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ЗначениеСостав", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

//Цена
&НаКлиенте
Процедура ОтборЦенаПриИзменении(Элемент)
	
	//Установить отбор
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМинимум",ОтборЦенаМинимум);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМаксимум",ОтборЦенаМаксимум);
	
	//Отобразить метку	
	МеткаЦенаЗаголовок = РаботаСОтборами.ФорматированнаяСтрокаПредставленияМетки(
		"" + ?(ЗначениеЗаполнено(ОтборЦенаМинимум), "от " + ОтборЦенаМинимум + " ", "") + ?(ЗначениеЗаполнено(ОтборЦенаМаксимум), "до " + ОтборЦенаМаксимум, ""), 
		"Метка_Цена");	
	
	Элементы.МеткаЦенаЗаголовок.Заголовок = МеткаЦенаЗаголовок;
	ОтборЦенаПриИзмененииСервер();	
	Элементы.ГруппаМеткаЦена.Видимость = Истина;	
	
КонецПроцедуры

Процедура ОтборЦенаПриИзмененииСервер()
	
	Элементы.МеткаЦенаЗаголовок.УстановитьДействие("ОбработкаНавигационнойСсылки", "МеткаЦенаЗакрыть");
	
КонецПроцедуры

&НаКлиенте
Процедура МеткаЦенаЗакрыть(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Сбросить отбор
	ОтборЦенаМинимум = 0;
	ОтборЦенаМаксимум = 0;
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМинимум",ОтборЦенаМинимум);
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("ОтборЦенаМаксимум",ОтборЦенаМаксимум);
	
	//Скрыть метку
	Элементы.МеткаЦенаЗаголовок.Заголовок = "";
	Элементы.ГруппаМеткаЦена.Видимость = Ложь;
КонецПроцедуры

//}Отборы

//Формирование заказа{
&НаКлиенте
Процедура СформироватьЗаказ(Команда)
	
	Если ВозможныйЗаказ.Количество() = 0 Тогда 
		Сообщить("Нет товара для заказа.",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта");
    ДанныеЗаказа = Форма.Объект;
    ЗаполнитьЗаказСервер(ДанныеЗаказа);
    КопироватьДанныеФормы(ДанныеЗаказа, Форма.Объект);
    Форма.Открыть();
	
	//Сброс заказа
	ВозможныйЗаказ.Очистить();
	мсВЗаказ = Новый Массив;
	СписокТоваров.Параметры.УстановитьЗначениеПараметра("мсВЗаказ", мсВЗаказ);		
	Элементы.ВозможныйЗаказ.Видимость = мсВЗаказ.Количество() <> 0;
	
КонецПроцедуры

Процедура ЗаполнитьЗаказСервер(ДанныеЗаказа)
	
	//ДанныеЗаказа = Документы.ЗаказПокупателя.СоздатьДокумент();	
	ДанныеЗаказа.Дата = ТекущаяДата();
	ДанныеЗаказа.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДанныеЗаказа.Статус = Справочники.СтатусыЗаказов.НайтиПоНаименованию("Новый");
	ДанныеЗаказа.ВидЗаказа = Перечисления.ВидыЗаказовПокупателей.Розничный;
	ДанныеЗаказа.Склад = Справочники.Склады.НайтиПоНаименованию("Основной");
	
	//ЗаполнитьТовары
	Для Каждого Строка Из ВозможныйЗаказ Цикл
		
		нСтрока = ДанныеЗаказа.Товары.Добавить();
		нСтрока.Номенклатура = Строка.Номенклатура;
		нСтрока.Количество = Строка.Количество;
		нСтрока.Цена = Строка.Цена;
		нСтрока.Сумма = Строка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

//}Формирование заказа
